Revit 2027 API
LinkNode.GetDocument Method
 Returns the document associated with the link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetDocument()
Public Function GetDocument As Document
public:
Document^ GetDocument()
member GetDocument : unit -> Document
Return Value
Document
 Instance of a Document
Remarks
 The document is in read-only state. Transactions are not allowed in it.
See Also
Reference
LinkNode Class
Autodesk.Revit.DB Namespace